Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/arrests/confessions.html.txt.tmx
Source language: en
Languages: ga

source: If you make a confession to the Gardai, that confession can be used in your trial as evidence against you
ga: Má admhaíonn duine aon cheo do na Gardaí, is féidir an admháil sin a úsáid mar fhianaise ina c(h)oinne sa chúirt

source: A voluntary confession is a confession that has not been coerced or forced from you and has been made with your true and free will
ga: Admháil a dhéanann duine gan aon iallach a bheith air/uirthi agus a dhéanann duine as a d(h)eoin féin í admháil uaidh/uaithi féin

source: If you make a confession that is not voluntary, it cannot be admitted as evidence against you in your trial
ga: Má dhéanann duine admháil nach uaidh/uaithi féin í, ní féidir an admháil sin a úsáid mar fhianaise ina c(h)oinne ag an triail

source: Even if a confession was given voluntarily, it may still be inadmissible because of the oppressive or unfair circumstances in which it was obtained
ga: Fiú má dhéanann duine adhmáil uaidh/uaithi féin, d'fhéadfadh sé nach mbeadh cead í a úsáid sa chúirt de bharr na gcúinsí míchothroma nó éigneacha ina déanadh an admháil sin

source: A confession will be considered by a court to be involuntary if it was obtained by physical or psychological pressures or by threats or promises made by persons in authority
ga: Déanfaidh an Chúirt cinneadh nach admháil uaidh/uaithi féin a rinne an té atá cúisithe má baineadh úsáid as brú fisiciúil nó síceolaíochta leis an admháil sin a fháil nó má rinne aon duine i gceannas aon bhagairt ar an té atá cúisithe nó má gealladh aon cheo dó/dí as an admháil sin a thabhairt

source: Threats or promises, which create fear or hope, may take away your free will
ga: Má dhéantar bagairt ar dhuine nó rudaí a gheallúint dó/dí a chuireann eagla air/uirthi nó a thugann dóchas dó/dí, d'fhéadfadh sé nach mbeadh an duine sin ag feidhmiú as a d(h)eoin féin

source: Therefore, a confession made as a result of a threat or a promise made by a person in authority is not a voluntary statement
ga: Mar sin, aon admháil a dhéanann duine de bharr bagartha nó gealltanais uaidh duine i gceannas ní féidir a rá gur ráiteas uaidh/uaithi féin atá ann

source: A confession will also be considered to be involuntary if it was obtained by the use of drugs, hypnosis, alcohol, long-drawn-out interrogation, excessive questioning or any method that takes away your rational intellect or free will
ga: Ní ghlacfar le hadmháil ach an oiread má baineadh úsáid as drugaí, hipneois, alcól, tréimhse fada agallaimh, ceistiú iomarcach nó aon mhódh oibre eile a bhaineann an mheabhair réasúnach nó an toil féin den duine leis an admháil sin a fháil

source: Basic standards of fairness must be met
ga: Ní mór bunchaighdeáin chothroime a shásamh

source: For example, if you make a confession after successive bouts of questioning and without having obtained adequate sleep and rest, a court may consider the statement inadmissible
ga: Mar shampla, má admhaíonn duine baint a bheith aige/aici le coir tar éis tréimhsí ceistiúcháin as a chéile gan dóthain codalta agus scíthe a bheith fáighte aige/aici d'fhéadfadh an chúirt cinneadh a dhéanamh nach féidir úsáid a bhaint as an admháil sin mar fhianaise
